/* ------------------------------------------------------------------------ */
/*  Hyper Operating System V4  μITRON4.0仕様 Real-Time OS                  */
/*    ITRONカーネル タスク例外処理機能                                      */
/*                                                                          */
/*                                  Copyright (C) 1998-2002 by Project HOS  */
/*                                  http://sourceforge.jp/projects/hos/     */
/* ------------------------------------------------------------------------ */


#include "knl_tsk.h"



/* タスク例外処理禁止状態の参照 */
BOOL sns_tex(void)
{
	BOOL state;
	
	mknl_loc_sys();	/* システムのロック */

	state = mknl_sns_tex();		/* タスク例外処理禁止状態の参照 */

	mknl_unl_sys();	/* システムのロック解除 */

	return state;
}


/* ------------------------------------------------------------------------ */
/*  Copyright (C) 1998-2002 by Project HOS                                  */
/* ------------------------------------------------------------------------ */
