/* ------------------------------------------------------------------------ */
/*  HOS-V4                                                                  */
/*    ITRONカーネル 割り込み制御                                            */
/*                                                                          */
/*                              Copyright (C) 1998-2002 by Ryuji Fuchikami  */
/* ------------------------------------------------------------------------ */



#include "kernel.h"



/* 割り込み処理実行（μカーネルより呼び出し） */
void kernel_exe_int(INTNO intno)
{
	T_KERNEL_INTCB intcb;
	
	/* 割り込み解除前にローカルにコピー */
	intcb = kernel_intcb_tbl[intno];

	/* 割り込み解除（多重割り込み許可） */
	mknl_ena_int();

	/* 割り込みサービスルーチン実行 */
	intcb.isr(intcb.exinf);

	/* 割り込み禁止（多重割り込み許可） */
	mknl_ena_int();
}



/* ------------------------------------------------------------------------ */
/*  Copyright (C) 1998-2002 by Ryuji Fuchikami                              */
/* ------------------------------------------------------------------------ */
