/* ------------------------------------------------------------------------ */
/*  HOS-V4                                                                  */
/*    システム時間管理                                                      */
/*                                                                          */
/*                              Copyright (C) 1998-2002 by Ryuji Fuchikami  */
/* ------------------------------------------------------------------------ */


#include "kernel.h"



/* システム時刻の設定 */
ER set_tim(
		const SYSTIM *p_systim)	/* システム時刻に設定する時刻 */
{
	mknl_loc_sys();		/* システムのロック */

	/* システム時刻の設定 */
	kernel_systim = *p_systim;

	mknl_unl_sys();		/* システムのロック解除 */

	return E_OK;
}



/* ------------------------------------------------------------------------ */
/*  Copyright (C) 1998-2002 by Ryuji Fuchikami                              */
/* ------------------------------------------------------------------------ */
