/* ------------------------------------------------------------------------ */
/*  HOS-V4 サンプル                                                         */
/*   プロセッサ抽象化コンポーネント (日立 H8/300H 用)                       */
/*                                                                          */
/*                              Copyright (C) 1998-2002 by Ryuji Fuchikami  */
/* ------------------------------------------------------------------------ */


#include "kernel.h"



/* 割り込みマスク指定 */
ER chg_imsk(IMSK imsk)
{
	/* パラメーターチェック */
#ifdef HOS_ERCHK_E_PAR
	if ( (imsk & ~(H83_IMSK_I_BIT | H83_IMSK_I_BIT)) != 0 )
	{
		return E_PAR;
	}
#endif

	mknl_loc_sys();		/* システムのロック */

	kernel_h83_imsk = imsk;		/* 割り込みマスクの設定 */

	mknl_unl_sys();		/* システムのアンロック */

	return E_OK;
}



/* ------------------------------------------------------------------------ */
/*  Copyright (C) 1998-2002 by Ryuji Fuchikami                              */
/* ------------------------------------------------------------------------ */
