/* ------------------------------------------------------------------------ */
/*  HOS-V4 サンプル                                                         */
/*   プロセッサ抽象化コンポーネント (日立 H8/300H 用)                       */
/*                                                                          */
/*                              Copyright (C) 1998-2002 by Ryuji Fuchikami  */
/* ------------------------------------------------------------------------ */


#include "kernel.h"



/* 割り込みマスク参照 */
ER get_imsk(IMSK *p_imsk)
{
	mknl_loc_sys();		/* システムのロック */

	*p_imsk = kernel_h83_imsk;		/* 割り込みマスクの取得 */

	mknl_unl_sys();		/* システムのアンロック */

	return E_OK;
}



/* ------------------------------------------------------------------------ */
/*  Copyright (C) 1998-2002 by Ryuji Fuchikami                              */
/* ------------------------------------------------------------------------ */
