/* ------------------------------------------------------------------------ */
/*  Hyper Operating System V4  μITRON4.0仕様 Real-Time OS                  */
/*   プロセッサ抽象化コンポーネント (日立 H8 用)                            */
/*                                                                          */
/*                                  Copyright (C) 1998-2002 by Project HOS  */
/*                                  http://sourceforge.jp/projects/hos/     */
/* ------------------------------------------------------------------------ */


#include "kernel.h"



/* 割り込みマスクのベース値の参照 */
ER get_imsk(
		IMSK *p_imsk)	/* 現在のマスク値の格納番地 */
{
	mknl_loc_sys();		/* システムのロック */
	
	*p_imsk = kernel_h83_ibmsk;		/* 割り込みマスクベース値の取得 */
	
	mknl_unl_sys();		/* システムのアンロック */
	
	return E_OK;
}


/* ------------------------------------------------------------------------ */
/*  Copyright (C) 1998-2002 by Project HOS                                  */
/* ------------------------------------------------------------------------ */
