/* ------------------------------------------------------------------------ */
/*  HOS-V4                                                                  */
/*    ITRONカーネル システム状態管理                                        */
/*                                                                          */
/*                              Copyright (C) 1998-2002 by Ryuji Fuchikami  */
/* ------------------------------------------------------------------------ */


#include "knl_sys.h"



/* ディスパッチの禁止 */
ER dis_dsp(void)
{
	mknl_loc_sys();	/* システムのロック */

	mknl_dis_dsp();	/* ディスパッチの禁止 */

	mknl_unl_sys();	/* システムのロック解除 */

	return E_OK;
}



/* ------------------------------------------------------------------------ */
/*  Copyright (C) 1998-2002 by Ryuji Fuchikami                              */
/* ------------------------------------------------------------------------ */
