/* ------------------------------------------------------------------------ */
/*  HOS-V4                                                                  */
/*    ITRONカーネル システム状態管理                                        */
/*                                                                          */
/*                              Copyright (C) 1998-2002 by Ryuji Fuchikami  */
/* ------------------------------------------------------------------------ */


#include "knl_sys.h"



/* ディスパッチ禁止状態の参照 */
BOOL sns_dsp(void)
{
	BOOL state;
	
	mknl_loc_sys();	/* システムのロック */

	state = mknl_sns_dsp();		/* ディスパッチ禁止状態の参照 */

	mknl_unl_sys();	/* システムのロック解除 */

	return state;
}



/* ------------------------------------------------------------------------ */
/*  Copyright (C) 1998-2002 by Ryuji Fuchikami                              */
/* ------------------------------------------------------------------------ */
