/* ------------------------------------------------------------------------ */
/*  HOS-V4                                                                  */
/*    ITRONカーネル システム状態管理                                        */
/*                                                                          */
/*                              Copyright (C) 1998-2002 by Ryuji Fuchikami  */
/* ------------------------------------------------------------------------ */


#include "knl_sys.h"



/* CPUロック状態の解除 */
ER unl_cpu(void)
{
	mknl_loc_sys();	/* システムのロック */

	mknl_unl_cpu();	/* CPUのロック解除 */
	mknl_dly_dsp();	/* 遅延ディスパッチの実行 */

	mknl_unl_sys();	/* システムのロック解除 */

	return E_OK;
}



/* ------------------------------------------------------------------------ */
/*  Copyright (C) 1998-2002 by Ryuji Fuchikami                              */
/* ------------------------------------------------------------------------ */
