/* ------------------------------------------------------------------------ */
/*  HOS-V4                                                                  */
/*    μカーネル タスク制御                                                 */
/*                                                                          */
/*                              Copyright (C) 1998-2002 by Ryuji Fuchikami  */
/* ------------------------------------------------------------------------ */


#include "mknl.h"



/* タスクの強制待ち解除 */
void mknl_rsm_tsk(
		T_MKNL_TCB *mtcb)	/* 強制待ち解除するタスク */
{
	/* 強制待ち解除 */
	if ( mtcb->tskstat == TTS_WAS )
	{
		mtcb->tskstat = TTS_WAI;		/* 二重待ち状態なら待ち状態 */
	}
	else
	{
		mtcb->tskstat = TTS_RDY;		/* 強制待ち状態なら実行可能状態 */
	}
}


/* ------------------------------------------------------------------------ */
/*  Copyright (C) 1998-2002 by Ryuji Fuchikami                              */
/* ------------------------------------------------------------------------ */
