/* ------------------------------------------------------------------------ */
/*  HOS-V4                                                                  */
/*    μカーネル システム制御                                               */
/*                                                                          */
/*                              Copyright (C) 1998-2002 by Ryuji Fuchikami  */
/* ------------------------------------------------------------------------ */


#include "mknl.h"



/* スタートアップルーチンの開始処理 */
void mknl_sta_startup(void)
{
	mknl_ctx_stat = MKNL_TSS_INDP | MKNL_TSS_DINT;	/* 割り込み禁止でタスク独立部に設定 */
}


/* ------------------------------------------------------------------------ */
/*  Copyright (C) 1998-2002 by Ryuji Fuchikami                              */
/* ------------------------------------------------------------------------ */
